{
  "Monday, August 14, 2023": {
    "Breakfast": "Avocado Toast on Whole Grain Bread - Side of Banana Slices",
    "Lunch": "French Grilled Ham and Cheese Sandwich (Croque Monsieur) + Little Gem Lettuce Salad",
    "Dinner": "Grilled Rib Eye Steaks with French Fries and Corn on the Cob - American classic grilled steaks with a side of sweet potato fries and corn on the cob."
  },
  "Tuesday, August 15, 2023": {
    "Breakfast": "Blueberry Muffins (made with whole wheat flour) - Side of Greek Yogurt",
    "Lunch": "Sloppy Joe with Coleslaw + Pickles and Corn on the Cob",
    "Dinner": "French coq au vin blanc with Garlic Smashed Potatoes and a Mixed Green Salad - A twist on the classic, using white wine, served with garlic-infused potatoes and a refreshing salad."
  },
  "Wednesday, August 16, 2023": {
    "Breakfast":"Turkey Breakfast Sausage with Whole Wheat Pancakes - Side of Fresh Melon",
    "Lunch": "Classic American Club Sandwich with Potato Salad + Fresh Fruit Salad",
    "Dinner": "Spanish Chicken and Chorizo Paella (rice dish) with a side of Grilled Vegetables - Spanish rice dish with a side of grilled summer vegetables."
  },
  "Thursday, August 17, 2023": {
    "Breakfast": "Waffles with a Drizzle of Honey and Homemade Almond Butter - Side of Peach Slices",
    "Lunch": "Penne alla Vodka with Garlic Bread - Served with a side of Fresh Spinach Salad",
    "Dinner": "Grilled Italian Sausage Skewers with Onion and Pepper and Fresh Fruit Salad - Italian sausages served with colorful bell pepper stir fry and a refreshing fruit salad."
  },
  "Friday, August 18, 2023": {
    "Breakfast": "English Muffin with Honey Roasted Turkey and Cheese - Side of Kiwi",
    "Lunch": "Italian Margherita Pizza with Fresh Romaine Salad + Garlic Breadsticks",
    "Dinner":"Ivan Ramen Style Ramen"
  },
  "Saturday, August 19, 2023": {
    "Breakfast": "Greek Yogurt Parfait with Granola and Fresh Berries",
    "Lunch": "Grilled Chicken Caesar Salad - Served with a side of Garlic Bread",
    "Dinner": "Roasted Chicken with French Tarragon Sauce with Steamed Green Beans and Roasted Potatoes - Classic roast chicken served with a tarragon-infused sauce, green beans, and roasted potatoes."
  },
  "Sunday, August 20, 2023": {
    "Breakfast": "Banana and Peanut Butter Protein Smoothie",
    "Lunch": "Southern-Style Chicken and Waffles with Maple Syrup - Served with a side of Scrambled Eggs",
    "Dinner": "Pasta Puttanesca with Garlic Bread and Side Salad"
  }
}