{
  "Monday, May 22, 2023": {
    "Breakfast": "Breakfast Empanadas - Scrambled eggs, chorizo sausage, bell peppers, and onions tucked into puff pastry and baked to a golden crisp in a convection oven.",
    "Lunch": "Sous Vide BBQ Chicken Sandwiches - Chicken breast perfectly cooked sous vide style, slathered in BBQ sauce, and served in a bun with coleslaw.",
    "Dinner": "Pepperoni & Mushroom Pizza - Homemade pizza dough topped with marinara sauce, mozzarella cheese, pepperoni, and mushrooms, baked in the convection oven until the cheese is melted and bubbly.",
    "Dessert": "M&M's Chocolate Ice Cream Cookies"
  },
  "Tuesday, May 23, 2023": {
    "Breakfast": "Savory Breakfast Polenta - Creamy polenta cooked in the instapot, topped with crispy pancetta and a poached egg.",
    "Lunch": "Instapot Pulled Pork Tacos - Slow-cooked pork shoulder in the Instapot, shredded, and served on tortillas with a homemade salsa and fresh cilantro.",
    "Dinner": "Instapot Chicken and Sausage Jambalaya - A classic jambalaya made with chicken, sausage, and shrimp, cooked to perfection in the Instapot.",
    "Dessert": "Keebler Fudge Stripe Cookies"
  },
  "Wednesday, May 24, 2023": {
    "Breakfast": "Dutch Baby Pancake - A fluffy, baked pancake prepared with simple ingredients and finished with a dusting of powdered sugar and a squeeze of fresh lemon.",
    "Lunch": "Toasted Ham and Cheese Melt - Slices of ham and cheese layered on bread and toasted in the toaster oven until the cheese is melted and bubbly.",
    "Dinner": "Wok-Seared Pork Tenderloin with Orange Glaze - Pork tenderloin seared in the wok and served with a sweet and tangy orange glaze and a side of steamed broccoli.",
    "Dessert": "Hostess Twinkies"
  },
  "Thursday, May 25, 2023": {
    "Breakfast": "Toasted Breakfast Burritos - Scrambled eggs, black beans, and shredded cheese, wrapped in a tortilla and toasted to perfection in the toaster oven.",
    "Lunch": "Outdoor Wok Stir-fried Beef and Broccoli - Thin slices of beef and fresh broccoli stir-fried in a tangy sauce using the outdoor wok.",
    "Dinner": "Gourmet Turkey and Avocado Sandwiches - Freshly baked bread layered with slices of turkey, ripe avocado, and crisp lettuce, served with a side of homemade potato salad and a refreshing cucumber and mint salad.",
    "Dessert": "Breyers Natural Vanilla Ice Cream & Hershey's Chocolate Syrup"
  },
  "Friday, May 26, 2023": {
    "Breakfast": "Convection Oven Egg and Sausage Frittata - A fluffy egg frittata baked in the convection oven with sausage, bell peppers, and onions.",
    "Lunch": "Convection Oven Baked Ziti - Hearty pasta baked with a rich tomato sauce and plenty of cheese in the convection oven.",
    "Dinner": "Stuffed Bell Peppers - Bell peppers stuffed with a mixture of ground beef, rice, and tomato sauce, baked in the convection oven until the peppers are tender and the filling is cooked through.",
    "Dessert": "Pepperidge Farm Milano Cookies"
  },
  "Saturday, May 27, 2023": {
    "Breakfast": "Caramelized Banana French Toast - Thick slices of bread soaked in a sweetened egg mixture, pan-fried, and then topped with caramelized bananas.",
    "Lunch": "Microwave Chicken Quesadillas - Easy and quick quesadillas made with chicken, cheese, and a sprinkle of chili, heated in the microwave.",
    "Dinner": "Sous Vide Chicken with Strawberry Balsamic Sauce - Chicken breast cooked to perfection using the sous vide machine, served with a tangy strawberry balsamic sauce and a side of sautéed spring greens.",
    "Dessert": "Entenmann's Crumb Top Donuts"
  },
  "Sunday, May 28, 2023": {
    "Breakfast": "Wok-Fried Rice and Eggs - Leftover rice and diced ham stir-fried in the wok with scrambled eggs and a splash of soy sauce.",
    "Lunch": "Bologna Sandwiches with Homemade Pickles - Classic bologna sandwiches served on white bread with mustard and homemade pickles.",
    "Dinner": "Grilled Steak with Chimichurri and Grilled Vegetables - Juicy steak grilled to perfection and topped with a fresh and zesty chimichurri sauce, served with a medley of grilled vegetables including bell peppers, zucchini, and corn on the cob.",
    "Dessert": "Sara Lee Pound Cake & Strawberries"
  }
}
