{
  "Wednesday, June 14, 2023": {
    "Breakfast": "Ham and Cheese Croissants: Freshly baked croissants filled with thinly sliced ham and melted Swiss cheese. A perfect balance of savory and buttery flavors to start the day.",
    "Lunch": "Cobb Salad: A protein-packed salad with hard-boiled eggs, grilled chicken, avocado, blue cheese, bacon, and mixed greens.",
    "Dinner": "Grilled Chicken Tacos with Avocado Salsa: Juicy grilled chicken served in soft tortillas and topped with a fresh avocado salsa."
  },
  "Thursday, June 15, 2023": {
    "Breakfast": "Blueberry Banana Smoothie: Fresh blueberries, a ripe banana, a splash of almond milk, and a scoop of your favorite protein powder blended together for a quick and nutritious breakfast smoothie. The blueberries and banana offer a refreshing sweetness perfect for a June morning.",
    "Lunch": "Turkey Club Sandwich: A triple-decker sandwich with turkey, bacon, lettuce, tomato, and mayo, served on whole-grain bread.",
    "Dinner": "Grilled Pork Tenderloin with Quinoa Salad: Marinated pork tenderloin grilled to perfection, served with a light and refreshing quinoa salad featuring cherry tomatoes, cucumber, and a zesty lemon vinaigrette."
  },
  "Friday, June 16, 2023": {
    "Breakfast": "Fresh Strawberry Toast: Cream cheese spread on whole-grain toast, topped with fresh sliced strawberries, a drizzle of honey, and a sprinkle of chia seeds. A quick, fresh, and light breakfast for a warm June morning.",
    "Lunch": "BLT Pasta Salad: A refreshing and quick pasta salad that combines the classic flavors of a BLT sandwich with a tangy dressing.",
    "Dinner": "Ivan Ramen Styled Ramen: A homemade ramen dish inspired by the famous Ivan Ramen restaurant in New York City. This dish features a rich and flavorful broth, tender pork belly, and a soft-boiled egg."
  },
  "Saturday, June 17, 2023": {
    "Breakfast": "Open-faced Egg and Avocado Bagel: A fresh bagel spread with smashed avocado, topped with a sunny-side-up egg. A sprinkle of flaky sea salt, black pepper, and a splash of hot sauce complete this satisfying and quick-to-prepare breakfast.",
    "Lunch": "Tex-Mex Burrito Bowl: A bed of rice topped with seasoned chicken or beef, beans, corn, salsa, avocado, and a dollop of sour cream.",
    "Dinner": "Beef and Vegetable Kabobs: Marinated beef and summer vegetables skewered and grilled to perfection, served over a bed of couscous."
  },
  "Sunday, June 18, 2023": {
    "Breakfast": "Almond Butter and Raspberry Jam Waffles: Whole grain waffles spread with almond butter and a dollop of raspberry jam. This breakfast offers a twist on the classic PB&J.",
    "Lunch": "Chicken Caesar Wrap: A wrap filled with grilled chicken, romaine lettuce, parmesan cheese, and Caesar dressing.",
    "Dinner": "Classic Grilled Beef Burgers with Crispy Fries: Delicious grilled beef burgers paired with homemade crispy French fries."
  }
}
