{
  "Monday, July 10, 2023": {
    "Lunch": "Chicken Caesar Wrap: Grilled chicken, crispy lettuce, parmesan cheese, and a light Caesar dressing all wrapped in a soft, whole grain tortilla.",
    "Dinner": "Chicken Alfredo Pasta: Creamy Alfredo sauce, grilled chicken, fettuccine pasta seasoned with garlic, oregano, and freshly ground black pepper."
  },
  "Tuesday, July 11, 2023": {
    "Breakfast": "Avocado Toast with Poached Eggs: Nutritious and healthy sliced avocado spread on slices of grilled bread, topped off with perfectly poached eggs and a dash of red pepper flakes.",
    "Lunch": "Ham and Cheese Pinwheels: A kid-friendly lunch with ham and cheese rolled in a crescent roll dough, baked till they're hot and gooey.",
    "Dinner": "Pork and Vegetable Stir Fry with Rice: Sautéed pork strips with fresh colorful vegetables, tofu and rice, flavored with soy sauce, garlic, and ginger."
  },
  "Wednesday, July 12, 2023": {
    "Breakfast": "Huevos Rancheros: A hearty Mexican dish featuring sunny side-up eggs, fresh salsa, refried beans, and cheese, served on soft tortillas and garnished with refreshing cilantro.",
    "Lunch": "Tomato Soup and Grilled Cheese Sandwiches: A classic comfort food duo; creamy tomato soup paired with golden, gooey grilled cheese sandwiches made from whole wheat bread and cheddar cheese.",
    "Dinner": "Chicken Parmesan with Spaghetti: Breaded chicken breast topped with marinara sauce and cheese, paired with spaghetti, seasoned with fresh basil, oregano and garlic."
  },
  "Thursday, July 13, 2023": {
    "Breakfast": "Banana Peanut Butter Protein Shake: A creamy blend of ripe banana, peanut butter, milk of your choice, a tad of honey, and a scoop of protein powder for an energizing and filling breakfast shake.",
    "Lunch": "Greek Chicken Pita Pockets: Grilled chicken strips marinated in a mix of yogurt, oregano, lemon, and garlic, stuffed in pita bread with tzatziki sauce, tomatoes, cucumbers, and lettuce.",
    "Dinner": "Takeout Night: A night off cooking, order in from your favorite local restaurant!"
  },
  "Friday, July 14, 2023": {
    "Breakfast": "French Toast with Cinnamon and Vanilla: Slices of bread soaked in a flavorful mixture of eggs, milk, vanilla, and cinnamon, pan-fried till golden, and served with a drizzle of maple syrup.",
    "Lunch": "Margarita Flatbread Pizza: Easy homemade flatbread topped with fresh tomatoes, mozzarella cheese, and basil leaves, drizzled with balsamic glaze.",
    "Dinner": "Ivan Ramen Styled Ramen: Delicious ramen noodles cooked in a rich chicken and dashi broth, garnished with tender slices of chicken, a soft-boiled egg, corn, and scallions."
  },
  "Saturday, July 15, 2023": {
    "Breakfast": "Gourmet Breakfast Sandwich: A satisfying sandwich made from a toasted English muffin stacked with a layer of fresh avocado, a fried egg, a slice of sharp cheddar cheese, and some smoky bacon.",
    "Lunch": "Vegetable Fried Rice: Quick and easy fried rice filled with vegetables like bell peppers, peas, and carrots, paired with scrambled eggs and flavored with low-sodium soy sauce.",
    "Dinner": "Taco Night with all the Fixings: Fun DIY dinner of tacos filled with ground beef cooked in flavorful spices, accompanied by shredded lettuce, diced tomatoes, cheddar cheese, sour cream, guacamole, and salsa."
  }
}