{
  "Monday, May 15, 2023": {
    "Breakfast": "Breakfast Quiche Cups - Mini quiches baked in a muffin tin, filled with bacon, spinach, onions, bell peppers, and cheddar cheese.",
    "Lunch": "Chicken Caesar Salad Wrap - Grilled chicken, romaine lettuce, Parmesan cheese, and Caesar dressing wrapped in a whole wheat tortilla, served with a side of baked sweet potato fries.",
    "Dinner": "Wok-Fried Singapore Rice Noodles - A savory and colorful noodle dish cooked in a wok, with thin rice noodles, tender shrimp, bell peppers, onions, and bean sprouts, all tossed in a mildly spicy curry sauce.",
    "Dessert": "Oreo Cookies - Classic chocolate sandwich cookies filled with sweet vanilla creme."
  },
  "Tuesday, May 16, 2023": {
    "Breakfast": "Pear and Almond Butter Toast - Slices of whole-grain toast topped with creamy almond butter, thinly sliced pear, and a sprinkle of cinnamon.",
    "Lunch": "Caprese Panzanella Salad - A fresh salad made with chunks of crusty bread, cherry tomatoes, fresh basil, mozzarella, and drizzled with balsamic glaze.",
    "Dinner": "Light appetizer - Edamame Hummus served with pita chips or fresh vegetable sticks.",
    "Dessert": "Ben & Jerry's Chocolate Fudge Brownie Ice Cream - Rich chocolate ice cream with chewy brownie chunks."
  },
  "Wednesday, May 17, 2023": {
    "Breakfast": "Stuffed French Toast - Thick slices of bread filled with a mix of cream cheese and raspberries, then dipped in egg mixture and baked in the convection oven.",
    "Lunch": "Turkey and Avocado Club Sandwich - Sliced turkey, crispy bacon, avocado, lettuce, and tomato, layered between toasted whole-grain bread with a spread of honey mustard.",
    "Dinner": "Indian-Mediterranean Chicken Tikka Gyros - Tender, yogurt-marinated chicken tikka wrapped in a warm pita bread, topped with cucumber, tomato, red onion, and a drizzle of cool mint raita, served with a side of fragrant basmati rice.",
    "Dessert": "Lindt Swiss Milk Chocolate - Smooth and creamy Swiss milk chocolate bar."
  },
  "Thursday, May 18, 2023": {
    "Breakfast": "Southwest Breakfast Burritos - Scrambled eggs, black beans, corn, and avocado wrapped in a warm tortilla, served with a side of fresh salsa.",
    "Lunch": "Japanese Chicken Teriyaki Bowl - Grilled teriyaki-glazed chicken served over steamed jasmine rice, accompanied by sautéed snap peas and shredded carrots, garnished with sesame seeds and green onions.",
    "Dinner": "French-Vietnamese Banh Mi Croissant Sandwich - A flaky croissant stuffed with lemongrass-marinated pork, pickled daikon and carrot, fresh cilantro, jalapeño, and a spread of sriracha mayo, served with a side of sweet potato fries.",
    "Dessert": "Haagen-Dazs Dulce de Leche Ice Cream - Creamy caramel ice cream swirled with ribbons of caramel sauce."
  },
  "Friday, May 19, 2023": {
    "Breakfast": "Sausage, Egg, and Cheese Muffins - Scrambled eggs, cooked breakfast sausage, and shredded cheddar cheese baked in a muffin tin and served warm.",
    "Lunch": "Mediterranean Stuffed Pita Pockets - Warm pita pockets filled with grilled chicken, hummus, diced cucumbers, red onion, Kalamata olives, and crumbled feta cheese, served with a side of tzatziki sauce.",
    "Dinner": "Korean-Italian Gochujang Bolognese - A fusion of Korean and Italian flavors, with a spicy gochujang-based tomato sauce,ground beef, and shiitake mushrooms served over al dente spaghetti, topped with grated Parmesan and chopped green onions.",
    "Dessert": "Biscoff Cookies - Crisp, caramelized European cookies with a hint of cinnamon."
  },
  "Saturday, May 20, 2023": {
    "Breakfast": "Breakfast Rice Bowl - A flavorful breakfast bowl with savory brown rice, sautéed spinach, cherry tomatoes, and a fried egg, garnished with a sprinkle of sesame seeds and a drizzle of sriracha.",
    "Lunch": "Greek Salad with Grilled Chicken - A classic Greek salad with crisp cucumbers, juicy tomatoes, Kalamata olives, red onion, and feta cheese, topped with marinated grilled chicken.",
    "Dinner": "Caribbean-American Jerk Chicken Pizza - A creative spin on pizza, with a thin crust topped with tangy barbecue sauce, spicy jerk chicken, red onion, pineapple, and a blend of mozzarella and smoked gouda cheese, baked in the convection oven.",
    "Dessert": "Talenti Sea Salt Caramel Gelato - Creamy gelato with sea salt caramel swirls and chocolate-covered caramel truffles."
  },
  "Sunday, May 21, 2023": {
    "Breakfast": "Banana Nut Waffles - Homemade waffles with mashed bananas and chopped walnuts, cooked in the convection oven and served with a side of warm maple syrup.",
    "Lunch": "Antipasto Skewers - Skewers with salami, mozzarella, cherry tomatoes, artichoke hearts, and Kalamata olives, drizzled with a light Italian dressing, served with a side of crusty bread.",
    "Dinner": "Moroccan-Spanish Paella Tagine - A combination of Moroccan and Spanish cuisine, with saffron-infused Arborio rice, tender chicken, spicy merguez sausage, bell peppers, and green peas, cooked together in a tagine for a rich and flavorful one-pot meal.",
    "Dessert": "Ghirardelli Dark Chocolate Raspberry Squares - Luscious dark chocolate squares filled with a sweet raspberry filling."
  }
}
