{
  "Monday, June 5, 2023": {
    "Lunch": "Turkey and Avocado Wraps: Sliced roast turkey and ripe avocado wrapped in whole grain tortillas, dressed with a light spread of Dijon mustard and mixed greens for a refreshing crunch.",
    "Dinner": "Singapore Mei Fun: Traditional stir-fried rice vermicelli with vegetables, shrimp, pork, and chicken, seasoned with curry powder, soy sauce, and a touch of heat from chili sauce."
  },
  "Tuesday, June 6, 2023": {
    "Breakfast": "Yogurt Parfait: Layered Greek yogurt, homemade granola, and a mix of fresh berries for a refreshing start of the day. Drizzle with a little honey to sweeten, if desired.",
    "Lunch": "Grilled Chicken Caesar Salad: Grilled chicken strips atop a bed of crisp romaine lettuce, tossed in Caesar dressing, with croutons and shaved parmesan.",
    "Dinner": "Beef Stir-Fry with Snow Peas and Carrots: Lean cuts of beef quickly stir-fried with crisp snow peas and carrots in a savory ginger garlic sauce."
  },
  "Wednesday, June 7, 2023": {
    "Breakfast": "Avocado Toast: Whole grain toast topped with ripe mashed avocado, a sprinkle of sea salt, and a touch of red pepper flakes. Serve with a side of poached eggs for protein.",
    "Lunch": "Caprese Panini: Fresh mozzarella, ripe tomatoes, and aromatic basil layered in ciabatta bread, drizzled with balsamic glaze, then pressed until crispy.",
    "Dinner": "Carne Asada Tacos: Store-bought carne asada grilled to perfection and served on corn tortillas with pico de gallo and a squeeze of lime."
  },
  "Thursday, June 8, 2023": {
    "Breakfast": "Belgian Waffles: Fluffy and golden Belgian waffles, served with maple syrup, fresh berries, and a dusting of powdered sugar.",
    "Lunch": "Quinoa Chicken Salad with Pesto: Grilled chicken, quinoa, cherry tomatoes, cucumber, and arugula tossed in homemade pesto dressing.",
    "Dinner": "Order In: A break from home-cooked meals, enjoy your favorite local eatery or try something new."
  },
  "Friday, June 9, 2023": {
    "Breakfast": "Banana Peanut Butter Protein Shakes: Blend frozen bananas, natural peanut butter, Greek yogurt, a drizzle of honey, and almond milk for a quick, protein-packed breakfast on the go.",
    "Lunch": "Greek Pita Pockets: Pita bread filled with grilled chicken, tomatoes, cucumbers, kalamata olives, feta cheese, and a homemade tzatziki sauce.",
    "Dinner": "Meatball Subs with Side Salad: Italian meatball subs topped with marinara sauce and melted mozzarella cheese. Serve with a side of green salad."
  },
  "Saturday, June 10, 2023": {
    "Breakfast": "Eggs Benedict: English muffin halves topped with Canadian bacon, poached eggs, and creamy hollandaise sauce. Serve with a side of roasted asparagus.",
    "Lunch": "Stir-Fried Beef and Broccoli: Tender strips of beef stir-fried with fresh broccoli florets in a savory garlic sauce. Serve over steamed jasmine rice.",
    "Dinner": "Chicken Quesadillas with Salsa: Cheesy chicken quesadillas served with fresh homemade salsa and a dollop of sour cream."
  },
  "Sunday, June 11, 2023": {
    "Breakfast": "Eggs Benedict: English muffins topped with a poached egg, ham, and rich hollandaise sauce.",
    "Lunch": "Chef's Salad: A hearty salad featuring a variety of deli meats and cheeses, hard-boiled eggs, tomatoes, cucumbers, and your choice of dressing.",
    "Dinner": "One-Pot Sausage and Broccoli Pasta Bake: Sausage and broccoli combined with pasta in a rich tomato sauce, topped with cheese and baked until golden."
  }
}
