{
  "Monday, May 29, 2023": {
    "Breakfast": "Pan-Fried Eggs and Toast: Eggs fried on the stovetop or using the outdoor wok burner, served with toast from the toaster oven and a side of homemade turkey sausage patties.",
    "Lunch": "Carnitas Nachos: Use store-bought carnitas and tortilla chips, top with cheese, diced tomatoes, and jalapenos, then bake until melted.",
    "Dinner": "Pressure Cooker Beef Stroganoff: Tender chunks of beef cooked with mushrooms and onions in a creamy sauce, prepared in the instapot. Serve this with a side of egg noodles cooked in the microwave."
  },
  "Tuesday, May 30, 2023": {
    "Breakfast": "Banana Bread Waffles: Unique waffles prepared on the wok burner using a banana bread batter, served with powdered sugar and fresh berries.",
    "Lunch": "Caprese Salad with Grilled Chicken: Layer sliced fresh mozzarella and tomatoes with fresh basil leaves, top with balsamic glaze, and add pre-cooked grilled chicken strips.",
    "Dinner": "Sous Vide Chicken Alfredo: Sous vide prepared chicken breast, served over fettuccine tossed in a homemade Alfredo sauce prepared in the wok. Pair it with a simple side salad."
  },
  "Wednesday, May 31, 2023": {
    "Breakfast": "Instapot Breakfast Risotto: A rich and creamy risotto made with Arborio rice, chicken stock, mushrooms, and bacon in the instapot, finished with freshly grated Parmesan cheese.",
    "Lunch": "Instapot Pasta and Meatballs: Combine pre-cooked meatballs, pasta, and marinara sauce in the instapot for a quick Italian meal.",
    "Dinner": "Toaster Oven Baked Chicken Parmesan: Breaded chicken cutlets baked in the toaster oven until crispy, then topped with marinara sauce and mozzarella cheese, served with spaghetti."
  },
  "Thursday, June 1, 2023": {
    "Breakfast": "Chicken and Waffles: Crispy fried chicken made in the wok, served with whole-grain waffles and a drizzle of maple syrup.",
    "Lunch": "Chicken Caesar Wrap: Fill a tortilla with pre-made Caesar salad mix and ready-cooked chicken strips, then heat briefly in the microwave.",
    "Dinner": "Dinner Out at a Restaurant: A break from home-cooked meals, enjoy your favorite local eatery or try something new."
  },
  "Friday, June 2, 2023": {
    "Breakfast": "Sous Vide Huevos Rancheros: Eggs prepared in the sous vide machine and served on a corn tortilla with refried beans and a fresh tomato salsa, cooked briefly on the outdoor wok.",
    "Lunch": "Chicken Teriyaki Bowls: Combine pre-cooked chicken, store-bought teriyaki sauce, instant rice, and steamed veggies for a quick Asian-inspired bowl.",
    "Dinner": "Wok Stir-Fried Pork and Green Beans: Pork tenderloin stir-fried in the wok with fresh green beans in a tangy soy and ginger sauce. Serve it with microwave-steamed jasmine rice."
  },
  "Saturday, June 3, 2023": {
    "Breakfast": "Oven-Baked Soufflé Pancakes: Fluffy soufflé pancakes baked in the convection oven. Serve with a side of breakfast sausage cooked in the toaster oven.",
    "Lunch": "Roast Beef Sandwiches: Make sandwiches with pre-cooked roast beef on fresh rolls with a horseradish mayo. Serve with microwave-steamed mixed vegetables.",
    "Dinner": "Chicken Tacos: Chicken cooked with Mexican spices on the wok, served in tortillas with fresh toppings like lettuce, tomatoes, and cheese."
  },
  "Sunday, June 4, 2023": {
    "Breakfast": "French Toast Casserole: A sweet and satisfying breakfast casserole made with brioche bread, eggs, cream, vanilla extract, and a cinnamon-sugar topping, baked in the convection oven.",
    "Lunch": "Greek Pita Plate: Serve pre-cooked gyro meat or chicken with store-bought pita bread, hummus, and a simple Greek salad of tomatoes, cucumbers, and feta cheese.",
    "Dinner": "Ivan Ramen-Style Ramen: Make Ivan Orkin's famous ramen at home with chicken-based broth, flavorful tare (sauce), noodles, and your choice of toppings like chashu chicken, scallions, and soft-boiled egg. Cook the broth and chashu chicken in the instapot for convenience."
  }
}
