{
  "Tuesday, January 30, 2024": {
    "Breakfast": "Peanut Butter and Banana Smoothie: Smoothie with peanut butter, banana, Greek yogurt, and protein powder. Sides: Whole grain toast, honey, and blueberries.",
    "Dinner": "Homemade Chicken Noodle Soup: Hearty chicken noodle soup with carrots, celery, and noodles. Served with crusty bread."
  },
  "Wednesday, January 31, 2024": {
    "Breakfast": "Hard-Boiled Eggs and Avocado: Hard-boiled eggs sliced and served with avocado. Sides: Cherry tomatoes, cheese sticks, and grapes.",
    "Dinner": "Ratatouille with Herbed Couscous: A mix of zucchini, eggplant, bell peppers, and tomatoes stewed with herbs. Served with herbed couscous."
  },
  "Thursday, February 1, 2024": {
    "Breakfast": "Quinoa Breakfast Bowl: Quinoa with almonds, honey, and berries. Sides: Greek yogurt, orange segments, and pumpkin seeds.",
    "Dinner": "Ivan Ramen Style Ramen: Served with broccoli, spinach, boiled eggs, and mushrooms."
  },
  "Friday, February 2, 2024": {
    "Breakfast": "Mushroom and Gruyere Omelette: Omelette with sautéed mushrooms and Gruyere cheese. Sides: Roasted cherry tomatoes, avocado slices, and strawberries.",
    "Dinner": "Turkey Club Sandwiches with Potato Salad"
  },
  "Saturday, February 3, 2024": {
    "Breakfast": "French Toast: Sides: Mixed berries, sliced fruit, and cheese.",
    "Dinner": "Beef Stroganoff: Beef and mushrooms in a creamy sauce, served over egg noodles."
  },
  "Sunday, February 4, 2024": {
    "Breakfast": "Scandinavian Breakfast Board: Assorted cheeses, boiled eggs, and cured meats. Sides: Whole grain toast, salad, and kiwi.",
    "Dinner": "Italian Sausage and Peppers Flatbread: Flatbread topped with Italian sausage, peppers, onions, and cheese. Accompanied by a mixed greens salad."
  },
  "Monday, February 5, 2024": {
    "Breakfast": "Shakshuka: Poached eggs in a spicy tomato and pepper sauce. Sides: Greek yogurt, olives, and mixed berries.",
    "Dinner": "Spaghetti Carbonara: Spaghetti with a sauce of eggs, cheese, and pancetta. Served with a side of garlic bread."
  }
}