{
  "Sunday, August 3, 2025": {
    "Breakfast": "Buttermilk Pancakes (Grace) – Scrambled eggs & bacon; orange wedges; warm Tiptree raspberry syrup. Ingredients: Bisquick, large eggs, whole milk, Tiptree preserve, granulated sugar; buttermilk, butter, bacon, 2 oranges.",
    "Dinner": "Sloppy Joe Sandwiches (Grace – Homestyle) – Brown ground chicken, warm Manwich sauce, toast buns. Sheet-pan zucchini “fries” (olive oil, Italian crumbs); tomato-palm salad with vinaigrette. Ingredients: Manwich, Perdue ground chicken, hamburger buns, zucchini, hearts of palm, Italian crumbs, grape tomatoes, garlic; olive oil, lettuce, red-wine vinegar."
  },
  "Monday, August 4, 2025": {
    "Breakfast": "Cinnamon-Sugar Biscuit Donuts (Grace) – Greek-yogurt & berries; Hershey’s chocolate drizzle. Ingredients: Pillsbury biscuits, granulated sugar, powdered sugar, Hershey’s syrup; ground cinnamon, 250 g berries, plain Greek yogurt.",
    "Dinner": "Chicken Tinga Tacos (Camila – Latin) – Poach/shred chicken, 10-min simmer in chipotle-tomato sauce, fill tortillas. Quick cilantro-lime rice; elote salad (frozen corn, crema). Ingredients: Chicken breast, Herdez chipotles, Contadina tomatoes, Mission tortillas, jasmine rice, Birds Eye corn, cilantro, limes; onion, avocado, queso fresco."
  },
  "Tuesday, August 5, 2025": {
    "Breakfast": "Sausage-Cheddar Bisquick Muffins (Grace) – Apple slices; honey-mustard dip. Ingredients: Bisquick (~220 g), large eggs (2), whole milk (120 ml), Kraft Singles (diced), Clover honey; 200 g cooked breakfast-sausage crumbles, 2 apples, 1 Tbsp Dijon.",
    "Dinner": "Falafel Pita Plate (Sofia – Mediterranean) – 30-sec blitz canned chickpeas → patties; pan-fry 6 min/side. Instant couscous tabbouleh; cucumber–tomato salad; tahini-garlic sauce. Ingredients: G-V chickpeas, Krinos tahini, couscous, limes, cilantro, garlic, sesame seeds; pita, parsley, cucumber, tomato, olive oil."
  },
  "Wednesday, August 6, 2025": {
    "Breakfast": "Peach-Pecan French-Toast Bake (Grace) – Maple-pecan crumble; grapefruit half; powdered-sugar glaze. Ingredients: Light brown sugar, pecan halves, large eggs, whole milk, powdered sugar; 8 brioche slices, 1 can peach slices, maple syrup, 1 grapefruit.",
    "Dinner": "Chicken Tikka Masala Kit (Arjun – Indian) – Sauté chicken cubes, add Patak’s 3-step sauce pack → 10-min simmer. Microwave jasmine rice; kachumber salad. Ingredients: Patak’s kit, chicken breast, heavy cream, jasmine rice, garlic, limes, cilantro; cucumber, tomato, red onion, naan."
  },
  "Thursday, August 7, 2025": {
    "Breakfast": "Breakfast Biscuit Sandwiches (Grace) – Hash-brown yellow potatoes; baby spinach; smoky Sriracha ketchup. Ingredients: Pillsbury biscuits (1 tube), large eggs (4), Kraft Singles (4 slices), yellow potatoes; 4 breakfast-sausage patties, 60 g baby spinach, ketchup, Sriracha.",
    "Dinner": "Croque Monsieur Tray-Bake (Étienne – French) – Assemble ham/cheese sandwiches, top with quick béchamel (flour + cream), broil 5 min. Air-fry shoestring potatoes; frisée-tomato salad with balsamic. Ingredients: All-purpose flour, heavy cream, Kraft Singles, Parmesan, yellow potatoes, Colavita balsamic, grape tomatoes; sandwich bread, ham, frisée, butter."
  },
  "Friday, August 8, 2025": {
    "Breakfast": "Crêpes Suzette (Étienne) – Breakfast-sausage links; orange-honey glaze. Ingredients: All-purpose flour, large eggs, Clover honey, granulated sugar; 50 g butter, 2 oranges, 250 g sausage links.",
    "Dinner": "BBQ Chicken Drumsticks (Grace – Homestyle) – Toss drumsticks in Bachan’s sauce & honey; roast 25 min at 425 °F. Bisquick corn-bread muffins; bagged slaw (dress with ranch + lime). Ingredients: Chicken drumsticks, Bachan’s BBQ, Clover honey, Bisquick, Birds Eye corn, limes, Marzetti ranch; buttermilk, shredded cabbage, butter."
  },
  "Saturday, August 9, 2025": {
    "Breakfast": "Greek Yogurt Fruit Bowl (Sofia) – Almond crunch; honey drizzle. Ingredients: Natural almonds (20 g, toasted & chopped), Clover honey; 300 g Greek yogurt, seasonal berries or diced fruit.",
    "Dinner": "Chicken-Broccoli Mac & Cheese (Grace – Homestyle) – Boil Kraft pasta; stir in cheese packet, diced sautéed chicken & steamed broccoli; finish under broiler with parm crumb. Garlic breadsticks. Ingredients: Kraft Mac & Cheese, boneless chicken breast, all-purpose flour, Italian crumbs, Parmesan, garlic; broccoli, mozzarella, butter, baguette."
  }
}
