{
  "Sunday, July 2, 2023": {
    "Breakfast": "Greek Yogurt Parfait - Greek yogurt topped with honey-drizzled fresh berries (strawberries, blueberries, raspberries) and a sprinkle of homemade granola.",
    "Lunch": "Greek Chicken Pita Wrap - Warm pita bread filled with marinated grilled chicken, cucumber, tomatoes, onions, and a homemade tzatziki sauce.",
    "Dinner": "Skillet Chicken and Ravioli - Juicy seared chicken breasts served with cheese-filled ravioli, bathed in a creamy herb sauce."
  },
  "Monday, July 3, 2023": {
    "Breakfast": "Mexican Breakfast Burrito - A hearty burrito filled with scrambled eggs, cheddar cheese, avocado, black beans, and salsa all wrapped in a whole grain tortilla.",
    "Lunch": "Summer Chicken Salad with Berries - A light and fresh salad with grilled chicken, mixed greens, fresh strawberries, blueberries, and a poppy seed dressing.",
    "Dinner": "Beef Stir-Fry with Broccoli and Mushrooms - Quick-cooking beef strips stir-fried with fresh broccoli florets and mushrooms in a savory soy-garlic sauce, served over steamed white rice."
  },
  "Tuesday, July 4, 2023": {
    "Breakfast": "Avocado Egg Toast - Multigrain toast topped with smashed ripe avocado, a poached egg, a sprinkle of feta cheese, and a drizzle of hot sauce.",
    "Lunch": "Grilled Peach and Burrata Salad - A delightful mix of grilled summer peaches, creamy burrata cheese, arugula, toasted almonds, and a honey-balsamic reduction.",
    "Dinner": "Chicken Piccata with Angel Hair Pasta - Tender chicken cutlets in a tangy lemon-caper sauce, served over a bed of angel hair pasta."
  },
  "Wednesday, July 5, 2023": {
    "Breakfast": "Peanut Butter Banana Smoothie - A smooth and creamy blend of ripe bananas, peanut butter, milk, and a dollop of Greek yogurt, served with a side of multigrain toast.",
    "Lunch": "Veggie Quesadilla - A crispy tortilla filled with sauteed bell peppers, onions, corn, black beans, and melted cheese, served with a side of salsa and sour cream.",
    "Dinner": "Margherita Pizza - A homemade pizza loaded with fresh mozzarella, ripe tomatoes, and basil leaves on a thin crust."
  },
  "Thursday, July 6, 2023": {
    "Breakfast": "Turkish Breakfast - A vibrant plate of olive oil-drizzled hummus, warm pita bread, sliced cucumbers and tomatoes, Kalamata olives, Feta cheese, and a boiled egg, accompanied with a cup of Turkish tea.",
    "Lunch": "Avocado Chicken Salad Wrap - Grilled chicken, ripe avocado, crisp lettuce, and diced tomatoes rolled in a whole-grain wrap with a spread of Greek yogurt.",
    "Dinner": "Grilled Chicken Tacos - Soft corn tortillas filled with grilled marinated chicken, fresh pico de gallo, sliced avocado, and a squeeze of fresh lime."
  },
  "Friday, July 7, 2023": {
    "Breakfast": "Baked Egg Muffins - Mini muffins made from whisked eggs, cheddar cheese, diced bell peppers, and onions, baked into a fluffy golden breakfast.",
    "Lunch": "BBQ Chicken Stuffed Sweet Potatoes - Baked sweet potatoes stuffed with shredded BBQ chicken, topped with green onions, and a dollop of sour cream.",
    "Dinner": "Fresh Pesto Pasta with Cherry Tomatoes - Al dente fusilli pasta tossed in a homemade basil pesto, mixed with juicy cherry tomatoes and Parmesan shavings."
  },
  "Saturday, July 8, 2023": {
    "Breakfast": "Pancakes with Fresh Berry Compote - Homemade pancakes served with a compote made from a variety of fresh berries (blueberries, blackberries, and raspberries), sweetened with honey.",
    "Lunch": "Mediterranean Orzo Salad - A refreshing salad of orzo pasta, fresh cherry tomatoes, diced cucumbers, Kalamata olives, red onions, crumbled feta cheese, and a lemon vinaigrette.",
    "Dinner": "Sheet Pan Greek Chicken and Vegetables - Marinated Greek chicken thighs roasted to perfection with potatoes, bell peppers, red onions, and Kalamata olives, served with Tzatziki sauce."
  },
  "Sunday, July 9, 2023": {
    "Breakfast": "Brioche French Toast Stuffed with Cream Cheese and Fresh Peaches - Thick slices of brioche dipped in egg mixture, pan-fried, and filled with a cream cheese-peach mixture, dusted with powdered sugar.",
    "Lunch": "Turkey & Cheese Panini - Perfect panini with smoked turkey, provolone cheese, sundried tomato spread, and fresh basil leaves on sourdough bread.",
    "Dinner": "BBQ Chicken Drumsticks with Corn on the Cob and Coleslaw - Flavorful barbecued chicken drumsticks served with buttery corn on the cob and a side of tangy, fresh coleslaw."
  }
}